# StructuralTopReleaseMx Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralTopReleaseMx Property
ParameterTypeId Class See Also
---
"Top Mx"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralTopReleaseMx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralTopReleaseMx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralTopReleaseMx {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace